package chap04;

/* 조건문 : 어떤 조건에 따라서 다르게 실행을 하고자 할 때
 * 종류 : if문, switch문
 * 반복문 ; 어떤 실행문을 반복 실행할 때 사용
 * 예) 1~10까지 숫자의 합, 한반의 시험을 보고 반 평균, 과목별 총점, 평균, 석차
 * 종류 : for문, while문 , do-while문
 * 어느 방법으로 하던지 관계가 없습니다. 특정한 방법으로 해야된다는 제약이 없음
 * 그렇지만 
 * for문 일정한 횟수를 반복 실행할 때 유용하다.
 * while문 : 무한 반복 실행하든지, 어떤 조건에서 종료를 할 경우 많이 사용
 * do-while문 : 무조건 실행문이 수행이되고, 그 다음에 반복조건을 판단하여 계속 여부를 결정할 때 사용
 * 
 * break문, continue문 : 반복문과 같이 사용
 * break문은 나를 감싸는 반복문을 벗어나고자 할 때 사용. 보통은 어떤 조건에 만족할 때 동작 하는 것이 일반적 
 * continue문 : 어떤 조건에서 이후의 실행문을 수행하지 않고 다음 조건식으로 이동해서 계속 반복을 하고자 할 때 사용
 * 
 * goto문 : 어떤 특정한 라벨(프로그램의 주소(위치)로 이동할 수 있음.) -> 일반적으로 잘 사용하지 않는다.
 *   - 프로그램의 흐름을 예측하기가 어렵다. 따라서 사용하지 않는 것이 좋겠다.
 */
public class Introduction {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
